### Pandas-DataFrame And Series

Pandas is a poweful data manipulation library in Python,widely used for data analysis and data cleaning.It provides two primary data structure:Series and DataFrame.A series is a one-dimensional array like-object,while a DataFrame is a two dimensional,size-mutable,and potentially heterogenous tabular data structure with labeled axes(rows and columns)

In [68]:
import pandas as pd

In [69]:
## Series
## Panda series is a one-dimensional array-like-object that can hold any data type.it is simiiar to a column in a table
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [70]:
## Create a series from dictionary

data={'a':1,'b':2,'c':3}
series_dicit=pd.Series(data)
print(series_dicit)

a    1
b    2
c    3
dtype: int64

In [71]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [72]:
## Data Frame
## Create a Data frame from a dicitionary of list

data={
    'name':['krish','guarav','jack'],
    'Age':[25,23,42],
    'City':['dehradun','dehli','bombay']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     name  Age      City
0   krish   25  dehradun
1  guarav   23     dehli
2    jack   42    bombay
<class 'pandas.core.frame.DataFrame'>

In [73]:
import numpy as np
np.array(data)

array({'name': ['krish', 'guarav', 'jack'], 'Age': [25, 23, 42], 'City': ['dehradun', 'dehli', 'bombay']},
      dtype=object)

In [82]:
## Create  a Data Frame from list of dictinories
data=[
    {'name':'krish','Age':32,'City':'dehradun'},
    {'name':'guarav','Age':22,'City':'bombay'},
    {'name':'krish','Age':32,'City':'delhi'},
    {'name':'krish','Age':32,'City':'dehradun'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     name  Age      City
0   krish   32  dehradun
1  guarav   22    bombay
2   krish   32     delhi
3   krish   32  dehradun
<class 'pandas.core.frame.DataFrame'>

In [75]:
df=pd.read_csv('1.csv')
df.head(5)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,8/24/2020,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,4/23/2021,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,(496)978-3969x58947,beckycarr@hogan.com,3/25/2020,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,-9892,stanleyblackwell@benson.org,6/2/2020,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,4/17/2021,https://goodwin-ingram.com/

In [76]:
df.tail(5)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,1/30/2022,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,605.413.3198,vkemp@ferrell.com,7/10/2021,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,9/18/2021,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,8/11/2021,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,3/11/2020,http://www.hatfield-saunders.net/

In [77]:
## Accessing data from data base
data

[{'name': 'krish', 'Age': 32, 'City': 'dehradun'},
 {'name': 'guarav', 'Age': 22, 'City': 'bombay'},
 {'name': 'krish', 'Age': 32, 'City': 'delhi'},
 {'name': 'krish', 'Age': 32, 'City': 'dehradun'}]

In [78]:
df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,8/24/2020,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,4/23/2021,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,(496)978-3969x58947,beckycarr@hogan.com,3/25/2020,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,-9892,stanleyblackwell@benson.org,6/2/2020,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,4/17/2021,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,1/30/2022,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,605.413.3198,vkemp@ferrell.com,7/10/2021,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,9/18/2021,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,8/11/2021,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,3/11/2020,http://www.hatfield-saunders.net/

In [83]:
df['name']

0     krish
1    guarav
2     krish
3     krish
Name: name, dtype: object

In [33]:
df.loc[0]

name       krish
Age           25
City    dehradun
Name: 0, dtype: object

In [37]:
df.iloc[0][2]

C:\Users\91817\AppData\Local\Temp\ipykernel_7784\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'dehradun'

In [40]:
## Accessing Specicfied element
df.at[1,'Age']

np.int64(23)

In [41]:
df.at[1,'name']

'guarav'

In [42]:
## Accessing a specified element with iat.
df.iat[2,2]

'bombay'

In [43]:
df

     name  Age      City
0   krish   25  dehradun
1  guarav   23     dehli
2    jack   42    bombay

In [44]:
## Data Manipulation with data Frame
df

     name  Age      City
0   krish   25  dehradun
1  guarav   23     dehli
2    jack   42    bombay

In [45]:
## adding a column
df['Salary']=[50000,60000,70000]
df

     name  Age      City  Salary
0   krish   25  dehradun   50000
1  guarav   23     dehli   60000
2    jack   42    bombay   70000

In [50]:
## REmove a column
df.drop('Salary',axis=1,inplace=True)

In [84]:
df

     name  Age      City
0   krish   32  dehradun
1  guarav   22    bombay
2   krish   32     delhi
3   krish   32  dehradun

In [66]:
## Add age too a column
df['Age']=df['Age']+1
df

     name  Age    City
1  guarav   27   dehli
2    jack   46  bombay

In [87]:
df.drop(0,inplace=True)

In [88]:
df

     name  Age      City
1  guarav   22    bombay
2   krish   32     delhi
3   krish   32  dehradun

In [89]:
df=pd.read_csv('1.csv')
df.head(5)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,8/24/2020,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,4/23/2021,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,(496)978-3969x58947,beckycarr@hogan.com,3/25/2020,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,-9892,stanleyblackwell@benson.org,6/2/2020,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,4/17/2021,https://goodwin-ingram.com/

In [90]:
## Displaying The data Types of each column
print("data type:\n",df.dtypes)

##Describe The DataFrame
print("statical summary:\n",df.describe())

data type:
 Index                 int64
Customer Id          object
First Name           object
Last Name            object
Company              object
City                 object
Country              object
Phone 1              object
Phone 2              object
Email                object
Subscription Date    object
Website              object
dtype: object
statical summary:
             Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [91]:
df.describe()

            Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [92]:
## Group by a column and perform an aggregation
grouped=df.groupby('category')['value'].mean()
print("Mean value by category:\n",grouped)

KeyError: 'category'